import "server-only";
import { contactDetails } from ".";

export const ApplicationMessages = {
  staff: {
    REG_INVITE: `এস ই ইলেকট্রনিকস এর সার্ভিস পয়েন্ট ও হাউস ওয়ারিং, অনলাইন ফর্ম আবেদন করতে লিংকটি ওপেন করে আবেদন করুন, এই ফর্মটির লিংক {registration_link_expiry} ঘন্টা পর অকার্যকর হয়ে যাবে {registration_link}`,
    ADMIN_NOTIF: ``,
    SUBMISSION: `প্রিয় {applicant_name},\nআপনার আবেদনটি সফলভাবে টেকনিশিয়ান সার্ভিস পয়েন্ট-এ জমা দেওয়া হয়েছে। আমরা আপনার তথ্য যাচাই করছি। যাচাই প্রক্রিয়া সম্পন্ন না হওয়া পর্যন্ত আমাদের সঙ্গে থাকার জন্য ধন্যবাদ।\nআবেদনটির স্ট্যাটাস ট্র্যাক করতে ভিজিট করুন\n{tracking_link}`,
    APPROVAL: `প্রিয় {applicant_name},\nঅভিনন্দন! আপনার আবেদনটি সফলভাবে যাচাই করা হয়েছে এবং টেকনিশিয়ান সার্ভিস পয়েন্ট-এ অনুমোদিত হয়েছে।\nযেকোনো তথ্যের জন্য ${contactDetails.customerCare}`,
    REJECTION: `প্রিয় {applicant_name},\nদুঃখিত,এনআইডি যাচাই সংক্রান্ত তথ্য ভুল থাকার কারণে আপনার আবেদনটি বাতিল করা হয়েছে।\nঅনুগ্রহ করে সঠিক তথ্য দিয়ে পুনরায় আবেদন করুন।`,
  },
  service: {
    ADMIN_NOTIF: `অনলাই সার্ভিসিং এর জন্য অনুরোধ করেছে তথ্য যাচাই করুন`,
    SUBMISSION: `প্রিয় {applicant_name},\nঅনলাইন সার্ভিসিং আইডি {service_id}, আপনার অনুরোধটি প্রাথমিক পর্যালোচনার পর্যায়ে রয়েছে। আপনার তথ্য ও সমস্যার যাচাই করে দেখছে, ধন্যবাদ।\nসকল তথ্য আপডেট পেতে ট্রেকিং লিংকটি ওপেন করুন। যেকোনো তথ্যের জন্য ${contactDetails.customerCare}\n{tracking_link}`,
    APPROVAL: `প্রিয় গ্রাহক {applicant_name},\nSE ELECTRONICS আপনার সার্ভিসিং এর অনুরোধটি গ্রহণ করা হয়েছে সার্ভিস আই ডি নং {service_id}, যে কোন তথ্যের জন্য ${contactDetails.customerCare} সার্ভিস স্ট্যাটাস ট্র্যাক করতে লিঙ্কটিতে ক্লিক করুন\n{tracking_link}`,
    REJECTION: `আমরা দুঃখিত যে আপনার সার্ভিসিং অনুরোধটি বাতিল করা হয়েছে। এই মুহূর্তে আমরা আপনার অনুরোধটি এগিয়ে নিতে পারছি না। বাতিলের কারণ বা অন্য কোনো সহায়তার জন্য অনুগ্রহ করে আমাদের কাস্টমার সাপোর্টের সাথেযোগাযোগ করুন। ${contactDetails.customerCare}, ${contactDetails.customerCare2}`,
  },
  subscription: {
    ADMIN_NOTIF: `আইপিএস, ব্যাটারি রক্ষণাবেক্ষণের সাবস্ক্রিপশন এর জন্য অনুরোধ করেছে তথ্য ও পেমেন্ট যাচাই করুন`,
    SUBMISSION: `প্রিয় {applicant_name},\nআপনার পছন্দের সাবস্ক্রিপশন প্যাকেজটির আবেদন সফলভাবে সাবমিট করেছেন, সাবস্ক্রিপশন আইডি {subscription_id} আপনার দেওয়া তথ্য ও পেমেন্ট সংক্রান্ত বিষয় যাচাই করে পরে ধাপে এগিয়ে যাব। সকল তথ্য আপডেট পেতে ট্রেকিং লিংকটি ওপেন করুন। যেকোনো তথ্যের জন্য ${contactDetails.customerCare}\n{tracking_link}`,
    APPROVAL: `প্রিয় {applicant_name},\nঅভিনন্দন! আপনার পছন্দের সাবস্ক্রিপশন প্যাকেজটির আবেদন সফলভাবে যাচাই করা হয়েছে এবং সার্ভিস পয়েন্ট-এ অনুমোদিত হয়েছে৷ যেকোনো তথ্যের জন্য 0964935555`,
    REJECTION: `আমরা দুঃখিত যে আপনার সাবস্ক্রিপশন অনুরোধটি বাতিল করা হয়েছে। এই মুহূর্তে আমরা আপনার অনুরোধটি এগিয়ে নিতে পারছি না। বাতিলের কারণ বা অন্য কোনো সহায়তার জন্য অনুগ্রহ করে আমাদের কাস্টমার সাপোর্টের সাথে যোগাযোগ করুন। ${contactDetails.customerCare}, ${contactDetails.customerCare2}`,
  },
};

export const MediaDownloadMessages = {
  CUSTOMER_INVOICE: `প্রিয় গ্রাহক {name}\nএস ই ইলেকট্রনিকস থেকে পন্য ক্রয় করার জন্য আপনাকে ধন্যবাদ আপনার ইনভয়েস ডাউনলোড করতে লিংকটি ক্লিক করুন। কাস্টমার কেয়ার ${contactDetails.customerCare}\n{download_link}`,
  CUSTOMER_REGISTRATION: `প্রিয় গ্রাহক {name},\nএস ই ইলেকট্রনিকস এ আপনাকে স্বাগতম! আপনার কাস্টমার আইডি: {customer_id} এবং ইনভয়েস নম্বর: {invoice_number}। লগইন করে ইনভয়েস ডাউনলোড করতে ভিজিট করুন: {dashboard_link}। কাস্টমার কেয়ার ${contactDetails.customerCare}`,
  INSTALL_PAYMENT_INVOICE: `প্রিয় {name},\nSE ELECTRONICS আপনার IPS ইনস্টল এর পেমেন্ট করা হয়েছে। নিচে ইনভয়েস সম্পর্কিত তথ্য দেওয়া হলো:\nইনভয়েস নম্বর: {invoice_number}\nতারিখ: {date}\nমোট পরিমাণ: {total_price}\nইনভয়েসটি দেখতে বা ডাউনলোড করতে এই লিঙ্কটি ব্যবহার করুন: {download_link}\nকাস্টমার কেয়ার ${contactDetails.customerCare}।`,
  REPAIR_PAYMENT_INVOICE: `প্রিয় {name},\nSE ELECTRONICS আপনার IPS সার্ভিসিং এর পেমেন্ট করা হয়েছে। নিচে ইনভয়েস সম্পর্কিত তথ্য দেওয়া হলো:\nইনভয়েস নম্বর: {invoice_number}\nতারিখ: {date}\nমোট পরিমাণ: {total_price}\nইনভয়েসটি দেখতে বা ডাউনলোড করতে এই লিঙ্কটি ব্যবহার করুন: {download_link}\nকাস্টমার কেয়ার ${contactDetails.customerCare}।`,
  TECHNICIAN_ID_CARD: `প্রিয় {staff_name},\nএস ই ইলেকট্রনিকস সার্ভিস পয়েন্ট আপনাকে স্বাগতম আপনার টেকনিশিয়ান আই ডি কার্ড টি ডাউনলোড করতে লিংকটি ক্লিক করুন।\n{download_link}\nকাস্টমার কেয়ার 0964935555`,
  ELECTRICIAN_ID_CARD: `প্রিয় {staff_name},\nএস ই ইলেকট্রনিকস সার্ভিস পয়েন্ট আপনাকে স্বাগতম আপনার ইলেকট্রিশিয়ান আই ডি কার্ড টি ডাউনলোড করতে লিংকটি ক্লিক করুন।\n{download_link}\nকাস্টমার কেয়ার 0964935555`,
  CERTIFICATE_DOWNLOAD: `প্রিয় {shop_owner_name} সার্ভিস পয়েন্ট SE ELECTRONICS আপনাকে সার্টিফিকেট প্রধান করেছে ডাউনলোড করে সংরক্ষণ করুন ভবিষ্যতে সকল সুযোগ সুবিধার পাওয়ার জন্য\n{download_link}`,
};

export const ServiceMessages = {
 CUSTOMER_REPAIR: `প্রিয় গ্রাহক {customer_name}, 
আপনার {service_id} সার্ভিসটি সমাধানের জন্য সার্ভিস টিম নিয়োগ করা হয়েছে। বিস্তারিত জানতে অনুগ্রহ করে আপনার ড্যাশবোর্ড চেক করুন।`,
  CUSTOMER_INSTALL: `প্রিয় গ্রাহক {customer_name},\nআপনার {service_id} প্যাকেজ টি ইন্সটল করার জন্য অফিসিয়াল ইন্সটল টিমকে নিযুক্ত করা হয়েছে। দ্রুত সময়ের মধ্যে ইন্সটল টিম আপনার সাথে যোগাযোগ করে সমাধান করবে। যে কোন তথ্যের জন্য ${contactDetails.customerCare}`,
  TECHNICIAN_APPOINT:
    "জনাব {staff_name},\nআপনাকে এস ই ইলেকট্রনিক্স কোম্পানির পন্য সার্ভিস করার জন্য নিয়োগ করা হয়েছে আপনি সম্মানিত কাস্টমার এর সাথে যোগাযোগ করে পন্যটির সমাধান দিন ধন্যবাদ।\nকাস্টমার নাম : {customer_name}\nকাস্টমার ফোন : {customer_phone}\nকাস্টমার সার্ভিস আই ডি নং : {service_id}\nপ্রোডাক্ট মডেল : {product_model}\nকাস্টমার লোকেশন : {customer_address}\nসার্ভিসিং সম্পর্কে তথ্য প্রদান করতে লিঙ্কটিতে ক্লিক করুন {service_report_url}",
  ELECTRICIAN_APPOINT:
    "জনাব {staff_name},\nআপনাকে এস ই ইলেকট্রনিক্স কোম্পানির পন্য IPS ইন্সটল করার জন্য নিয়োগ করা হয়েছে আপনি সম্মানিত কাস্টমার এর সাথে যোগাযোগ করে পন্যটির সমাধান দিন ধন্যবাদ।\nকাস্টমার নাম : {customer_name}\nকাস্টমার ফোন : {customer_phone}\nকাস্টমার সার্ভিস আই ডি নং : {service_id}\nপ্রোডাক্ট মডেল : {product_model}\nকাস্টমার লোকেশন : {customer_address}\nসার্ভিসিং সম্পর্কে তথ্য প্রদান করতে লিঙ্কটিতে ক্লিক করুন {service_report_url}",
  CONFIRMATION: `প্রিয় গ্রাহক {customer_name},\nSE ELECTRONICS আপনার সার্ভিসিং এর অনুরোধটি গ্রহণ করা হয়েছে সার্ভিস আই ডি নং {service_id}, যে কোন তথ্যের জন্য ${contactDetails.customerCare} সার্ভিস স্ট্যাটাস ট্র্যাক করতে লিঙ্কটিতে ক্লিক করুন\n{tracking_link}`,
  COMPLETION_INSTALL: `প্রিয় গ্রাহক {customer_name},\nআপনার IPS প্যাকেজ ইন্সটল সার্ভিস {service_id}, হাউস ওয়ারিং কাজ শেষ হয়েছে৷ অনুগ্রহ করে আপনার ফিডব্যাক এর জন্য ক্লিক করুন:\n{feedback_url}`,
  COMPLETION_REPAIR: `প্রিয় গ্রাহক {customer_name},\nআপনার সার্ভিস {service_id} সার্ভিসটি সমাধান করা হয়েছে। অনুগ্রহ করে আপনার ফিডব্যাক এর জন্য ক্লিক করুন:\n{feedback_url}`,
};
